{"data":{"markdownRemark":{"html":"<p>The blogosphere has been in a rather sad state as of late. The internet is riddled with burnt out shells of neglegted personal blogs that sport an outdated default WordPress theme and were last updated during a snowstorm in January 2016. Much blogging has moved to commercial platforms such as <a href=\"https://medium.com/\">Medium.com</a>, but another thing that happened is that the idea of personal blogging itself seems rather quaint now — a relic of the old web. As the internet has exploded in commercial value, the character of the web has become commercial as well. Brochure aesthetic has taken over web design. Everywhere you click, the web in 2019 is corporate, and while this isn't a bad thing in some respects, there is something profoundly boring about it.</p>\n<p>I created my new blog site with a feeling of nostalgia for what the web used to be — a place for freedom in ideas, and a diverse, grungy gathering place for weirdos, hucksters, and scholars. A place where you could let your mind escape your unremarkable physical surroundings to aimlessly wander the world. This kind of web still exists, but it seems that the zeitgeist of the web has moved on.</p>\n<p>Since nostalgia is a theme, I have tried to go with a mid 2000s style sparseness for my site design. The important thing is the content and I don't want anything else that is visually distracting. The design is somewhat inspired by <a href=\"https://www.salon.com/\">Salon.com</a>, which I think is one of the most distinctive looking news sites. Salon, of course, was web-only from its inception, and it has this look that is totally self-confident about being a web publication, which I love. Websites that put on a posh air and in doing so nakedly crave the prestige of print publications are deserving of scorn. I feel like Medium was the initiator of this trend although I can't be sure. The worst offender in recent memory is <a href=\"https://quillette.com/\">Quillete.com</a>, which is basically a parody of this phenomenon. The font choice hugely influences the impression given off by a website. I believe that the traditional look of the web is sans-serif, and I chose Roboto as my main text font, because I liked how it looked on Salon.  </p>\n<p>As for the technology, I am using <a href=\"https://www.gatsbyjs.org/\">GatsbyJS</a> to generate a static site. It was interesting to learn about Gatsby, which is extremely cool and trendy right now, but the idea of having a static site with no backend is rather old school. Gatsby makes updating a static site with new content as quick as using a WordPress-like CMS. The advantage of a static site is that I can host it for free on <a href=\"https://pages.github.com/\">GitHub Pages</a> (thanks, GitHub!), it's very quick to load, and seems safer in terms of security. I wouldn't necessarily recommend this setup for someone without web development experience, as Gatsby in particular had a pretty steep learning curve. Something like WordPress probably remains the easiest way to spin up a personal blog.</p>\n<p>I've made many failed attempts in the past to get myself to write regularly, but I'm hoping I have learned from my past experiences, and being a liberal, I believe that my nature can be overcome through structure. My downfall in the past has been that I would plan large blog posts about complicated topics, and then never feel inclined to finish them. On my new blog, I hope to write relatively short posts about simple topics like movies I watch, or books I read, and to do so frequently. I would like my main reason for blogging to be to improve my writing, so I'm not too concerned if no one ends up reading what I write here, although feedback is always nice and appreciated. Writing for web needs to be percussive and lively, and I know that I have a problem with having an overly heavy style. For this site I want to work on writing in a terse, clean voice, and really clean up some of the sloppy habits that I have developed. I do want to stick to general interest topics and avoid the deluge of pointless personal anecdotes that are an unfortunate hallmark of the blogosphere (a tweet I saw recently about how looking up a recipe for soup online obliges you to read someone's life story before you can learn how to make the soup comes to mind). I want to make a real effort to get good quality writing out there, but I'll try not to take myself too seriously in the process. </p>","frontmatter":{"date":"March 13, 2019","path":"/blog/newblog","title":"New Blog: Concept, Design, Technology"}}},"pageContext":{}}