{"data":{"markdownRemark":{"html":"<p>There is something seriously wrong with modern American fiction. I am neither well-read nor smart enough to persuasively argue this point, but the fact remains that I can hardly find any American fiction from the 21st century that I can say really transformed my inner life, which is the promise of great writing. There is a tremendous variety of professionally written fiction out there and yet it all seems to lack that soulfulness that is impossible to fake and makes a work truly worth reading.</p>\n<p>By the way, I am not some sort of America hater. It is clear to me that the best movies and TV shows in the world are currently made in America. And we have no shortage of great writers in America. American non-fiction writing is amazing and is probably among the world's most credible and compelling. But for some reason this is not true for novels. Perhaps the form of the novel never really suited the practical American character anyways. We Americans have little patience for idling flâneurs—our proudest achievements are our plumbing and bridges, as Marcel Duchamp noted. And here is perhaps a part of what bothers me about the modern American novel: I often get the feeling that the American novel is often mainly a practical endeavor for the novelist, an exercise in increasing the writer's personal wealth and status (at least Fitzgerald had the decency to admit this motivation when he wrote <em>This Side of Paradise</em>!) Perhaps as an extension of this, I feel that American novelists have too much of a desire to impress, as well as a great fear of causing offense. They are too beholden to what Tocqueville identified as America's dictator: public opinion. All this is cause for pessimism when browsing the fiction section in the bookstore.</p>\n<p>I much prefer to read fiction from outside America. The books that are sort of my ideals of what a novel should be capable of come from Russia. Reading <em>Generation P</em> by Victor Pelevin forever changed my relationship to the written word and society. And apparently Pelevin and I share the experience of opening up <em>Master and Margarita</em> by Mikhail Bulgakov, and being blown away to another world from which we would never return.</p>\n<p>It is from this background that I started reading <em>The Idiot</em> by Elif Batuman with high expectations. I figured that a scholar of Russian literature might be just the right person to write a truly great modern American novel. It goes without saying that <em>The Idiot</em> did not live up to these unrealistic expectations I had. I thought it was a solidly above-average book, but it's not a book that impacted me in a significant way and I will probably forget about it before too long. I did read Batuman's non-fiction memoir <em>The Possessed</em> before reading <em>The Idiot</em>, which had the effect of revealing to me that many of the happenings in <em>The Idiot</em> are lifted straight from Batuman's actual life. Many of these anecdotes, which are hilarious when recounted in <em>The Possessed</em>, lose much of their meaning when spliced into <em>The Idiot</em>. I hope for a novel to be something more than a collection of random happenings, although too much structure can suffocate a work too. For me, <em>The Idiot</em> was a little too disjointed to leave much of an impression on me.</p>\n<p>True to her nationality however, Batuman is a fabulous non-fiction writer. Her essay <a href=\"https://www.lrb.co.uk/v32/n18/elif-batuman/get-a-real-degree\">\"Get a Real Degree\"</a> in London Review of Books gave voice to many of the murky feelings I have about American fiction that I was unable to articulate myself. It is a great pleasure to read through her erudite slaying of literary mandarins. Here is a passage that I found myself silently applauding:  </p>\n<blockquote>\n<p>The continual production of ‘more excellent fiction … than anyone has time to read’ is the essence of the problem. That’s the torture of walking into a bookshop these days: it’s not that you think the books will all be terrible; it’s that you know they’ll all have a certain degree of competent workmanship, that most will have about three genuinely beautiful or interesting sentences and no really bad ones, that many will have at least one convincing, well-observed character, and that nearly all will be bound up in a story that you can’t bring yourself to care about. All that great writing, trapped in mediocre books! Who, indeed, has time to read them?</p>\n</blockquote>\n<p>A novel called <em>The Exception</em> by Danish writer Christian Jungersen is briefly mentioned in this article. I decided to read it, and it ended up being one of the best fiction books I have read in a long time. I had been feeling sort of burnt out by fiction and had been reading mainly non-fiction for a while, but reading <em>The Exception</em> totally restored my faith in the power of fiction. This is an ambitious book that operates on a few different levels, and I think mostly succeeds on all of them. The story is told from the perspective of four women who work together at the office of the Danish Centre for Genocide Information. First, it is an intensely detailed psychological look their interactions, slights both imagined and real, insecurities, and secrets. Additionally, there is an overarching question of if outbreaks of mass violence have their origins in human nature, and if those dark impulses can be found even in the developed West, even among educated, enlightened people working in a quiet office at the Center for Genocide Information. Lastly, <em>The Exception</em> is simply great entertainment. It is a heart-pounding thriller that had me glued to its pages until the very end. This reason alone is enough to say that <em>The Exception</em> is successful as a novel, but its fearless examination of larger, profound themes makes this book truly outstanding. I highly recommend that everyone read it. </p>","excerpt":"There is something seriously wrong with modern American fiction. I am neither well-read nor smart enough to persuasively argue this point, but the…","frontmatter":{"date":"September 12, 2019","path":"/blog/theexception","title":"Where Are the Good Books? Elif Batuman, Christian Jungersen"}}},"pageContext":{}}