{"data":{"allMarkdownRemark":{"edges":[{"node":{"id":"182e1203-4610-52b2-88c2-87757016ec6f","html":"<p>Bad Blood is the story of the rise and fall of Theranos. Theranos was a medical startup that promised to make veinous blood draws obsolete by running a variety of blood tests via a prick of the finger. The company had ambitions to place a Theranos device in every home in America. People would be able to prick their finger and place a drop of blood in their Theranos device, and receive their blood test results right away, all within the confines of their living room.  </p>\n<p>However, Theranos never even came close to solving the engineering challenges required to make this dream a reality. This is a predictable conclusion in retrospect. Theranos's core idea of making blood testing devices use less blood is fairly obvious and must have occurred to the established multinational medical device manufacturers as well - why would the upstart Theranos succeed where they had failed?  </p>\n<p>Theranos didn't let reality stand in the way of its march towards success. Theranos promised capabilities it did not have to enter partnerships with large chains such as Safeway and Walgreens to place Theranos testing centers in their retail locations. Engineers working at Theranos who were bullied into working late nights and weekends did make some progress, but the product they created was nothing more than a prototype, and often gave wildly inaccurate results for many blood tests. Rather than hit the brakes at this point as any responsible company would, Theranos decided to proceed with testing real patients' blood with cavalier disregard for their health and safety.  </p>\n<p>Theranos's trajectory was tightly bound with the personality of its founder and CEO, Elizabeth Holmes. Bad Blood is as much about Holmes the person as it is about Theranos the company. Holmes dropped out of Stanford to start Theranos. She deftly leveraged family and Stanford connections to open doors for Theranos and assemble a star-studded board of directors (among them Henry Kissinger and James \"Mad Dog\" Mattis). The media couldn't resist Holmes's story of a college dropout upending a staid industry, and a young woman succeeding in the male-dominated startup world. Many observers linked Holmes's larger than life personality with her memorable physical traits such as her deep voice and her hypnotically large eyes (incidentally, one of the sources interviewed in Bad Blood claims Holmes's deep voice is fake and deliberately cultivated). Also interesting is the role of Sunny Balwani, a Theranos executive who was feared by employees and was romantically involved with Holmes, unknown to the board. Any Theranos employees who expressed misgivings about the company's morally questionable actions faced Balwani's wrath. Theranos's celebrity backers made the company appear to be manifestly legitimate, while Holmes and Balwani carried out what was essentially a scam, gobbling up investor funds and corporate contracts while producing nothing but misleading promises and bogus test results.  </p>\n<p>Carreyrou sticks to the facts in his meticulous and no-nonsense telling of the Theranos story, which leaves the reader with more questions than answers. Theranos could not have gotten as far as it did without the support of its famous advocates, its large corporate partners, and fawning media coverage. How is it possible that all of these respectable people were taken in by Holmes and Balwani's chicanery? How could Holmes be clever enough to gain and betray the trust of America's most prominent public figures while at the same time carrying on a charade that was not only a danger to patients but was also clearly unsustainable? Carreyrou doesn't presume to know the answer to these questions. The reader is simply left with a sense of incredulity.   </p>\n<p>Theranos began to unravel after Carreyrou published a long form exposé in the Wall Street Journal. The latter part of Bad Blood deals with Carreyrou's battle with Theranos's desparate attempts to kill the story. This part of the book especially is a page turner. Seeing the fraud of Theranos unmasked in the end is a triumph for justice in this quintessentially American saga. </p>","excerpt":"Bad Blood is the story of the rise and fall of Theranos. Theranos was a medical startup that promised to make veinous blood draws obsolete by running a variety of blood tests via a prick of the finger. The company had ambitions to place a Theranos device in every home in America. People would be…","frontmatter":{"title":"REVIEW: Bad Blood - John Carreyrou","date":"March 12, 2019","path":"/blog/badblood"}}},{"node":{"id":"9a36dbc5-5381-57c4-860b-95fa6a43bef9","html":"<p>The value of an item with an integral type is the mathematical integer that it corresponds to. Integral types may be unsigned (capable of representing only non-negative integers) or signed (capable of representing negative integers as well).[1]</p>\n<p>An integer value is typically specified in the source code of a program as a sequence of digits optionally prefixed with + or −. Some programming languages allow other notations, such as hexadecimal (base 16) or octal (base 8). Some programming languages also permit digit group separators.[2]</p>\n<p>The internal representation of this datum is the way the value is stored in the computer's memory. Unlike mathematical integers, a typical datum in a computer has some minimal and maximum possible value.</p>\n<p>The most common representation of a positive integer is a string of bits, using the binary numeral system. The order of the memory bytes storing the bits varies; see endianness. The width or precision of an integral type is the number of bits in its representation. An integral type with n bits can encode 2n numbers; for example an unsigned type typically represents the non-negative values 0 through 2n−1. Other encodings of integer values to bit patterns are sometimes used, for example binary-coded decimal or Gray code, or as printed character codes such as ASCII.</p>\n<p>There are four well-known ways to represent signed numbers in a binary computing system. The most common is two's complement, which allows a signed integral type with n bits to represent numbers from −2(n−1) through 2(n−1)−1. Two's complement arithmetic is convenient because there is a perfect one-to-one correspondence between representations and values (in particular, no separate +0 and −0), and because addition, subtraction and multiplication do not need to distinguish between signed and unsigned types. Other possibilities include offset binary, sign-magnitude, and ones' complement.</p>\n<p>Some computer languages define integer sizes in a machine-independent way; others have varying definitions depending on the underlying processor word size. Not all language implementations define variables of all integer sizes, and defined sizes may not even be distinct in a particular implementation. An integer in one programming language may be a different size in a different language or on a different processor. </p>","excerpt":"The value of an item with an integral type is the mathematical integer that it corresponds to. Integral types may be unsigned (capable of representing only non-negative integers) or signed (capable of representing negative integers as well). 1 An integer value is typically specified in the source…","frontmatter":{"title":"Tales of Marsupials: REVIEW","date":"January 02, 2019","path":"/blog/post2"}}},{"node":{"id":"c78a8819-7c74-5f72-99c6-c6b8862314bf","html":"<p>content for blog post<br>\n<br> </p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/k-LCw4CGIV8\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n<br>\nnormal text here","excerpt":"content for blog post  ","frontmatter":{"title":"blog post title","date":"January 01, 2019","path":"/blog/post1"}}}]}},"pageContext":{}}